#+BEGIN_EXPORT html
---
layout: post
title: C programming
tagline: " not a monstrous task at all"
permalink: /c/emacs/ide/chromebook-hp-14a-0060nr.html
categories: [C, IDE, Emacs, Chromebook]
tags: [tutorial, ide, chromebook]
---
#+END_EXPORT

#+STARTUP: showall
#+OPTIONS: tags:nil num:nil \n:nil @:t ::t |:t ^:{} _:{} *:t
#+TOC: headlines 2
#+PROPERTY:header-args :results output :exports both :eval no-export
* Initial links
  Innate [[https://orgmode.org/worg/org-contrib/babel/languages/ob-doc-C.html][tutorial]]
* Primitive samples
** C
#+begin_src C
  printf ("Hello World!\n");
#+end_src

#+RESULTS:
: Hello World!

** C++

*** Simplified
    #+begin_src C++ :includes <stdio.h>
      int a=1;
      int b=1;
      printf("%d\n", a+b);
    #+end_src

 #+RESULTS:
 : 2

   
*** Holistic
    #+begin_src C++ :includes <iostream>
      std::cout<<"Hello World!\n";
    #+end_src

    #+RESULTS:
    : Hello World!
